/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "Tietokoneen internet-yhteys on pois päältä.";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "Tietokoneen internet-yhteys on ehkä pois päältä.";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "Tietokoneen internet-yhteys on päällä.";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "Tietokoneen DNS-palvelin ei vastaa.";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "DNS-palvelin ei löytänyt palvelimen nimeä.";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "Tietokoneen reititin ei vastaa.";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "Palvelin, johon tietokone yrittää muodostaa yhteyttä, ei vastaa.";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "Tietokoneen internet-yhteys on päällä.";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "Verkkolomakkeen salasana";

/* HTTP result code string */
"accepted" = "hyväksytty";

/* HTTP result code string */
"bad gateway" = "virheellinen yhdyskäytävä";

/* HTTP result code string */
"bad request" = "virheellinen pyyntö";

/* HTTP result code string */
"client error" = "asiakasvirhe";

/* HTTP result code string */
"conflict" = "ristiriita";

/* HTTP result code string */
"continue" = "jatka";

/* HTTP result code string */
"created" = "luotu";

/* HTTP result code string */
"expectation failed" = "odotus epäonnistui";

/* HTTP result code string */
"forbidden" = "kielletty";

/* HTTP result code string */
"found" = "löytyi";

/* HTTP result code string */
"gateway timed out" = "yhdyskäytävä aikakatkaistiin";

/* HTTP result code string */
"informational" = "tietoa antava";

/* HTTP result code string */
"internal server error" = "palvelimen sisäinen virhe";

/* HTTP result code string */
"length required" = "pituus vaaditaan";

/* HTTP result code string */
"method not allowed" = "menetelmä ei sallittu";

/* HTTP result code string */
"moved permanently" = "siirretty pysyvästi";

/* HTTP result code string */
"multiple choices" = "useita vaihtoehtoja";

/* HTTP result code string */
"needs proxy" = "tarvitsee välipalvelimen";

/* HTTP result code string */
"no content" = "ei sisältöä";

/* HTTP result code string */
"no error" = "ei virhettä";

/* HTTP result code string */
"non-authoritative information" = "varmentamaton tieto";

/* HTTP result code string */
"not found" = "ei löytynyt";

/* HTTP result code string */
"not modified" = "ei muokattu";

/* HTTP result code string */
"partial content" = "sisältöä puuttuu";

/* HTTP result code string */
"payment required" = "vaatii maksun";

/* HTTP result code string */
"precondition failed" = "ennakkoehto epäonnistui";

/* HTTP result code string */
"proxy authentication required" = "välipalvelimen autentikointi vaaditaan";

/* HTTP result code string */
"redirected" = "uudelleenohjattu";

/* HTTP result code string */
"no longer exists" = "ei ole enää olemassa";

/* HTTP result code string */
"request timed out" = "pyyntö aikakatkaistiin";

/* HTTP result code string */
"request too large" = "pyyntö liian suuri";

/* HTTP result code string */
"requested URL too long" = "pyydetty osoite liian pitkä";

/* HTTP result code string */
"requested range not satisfiable" = "pyydettyä aluetta ei voida täyttää";

/* HTTP result code string */
"reset content" = "nollaa sisältö";

/* HTTP result code string */
"see other" = "katso muu";

/* HTTP result code string */
"server error" = "palvelinvirhe";

/* HTTP result code string */
"service unavailable" = "palvelu ei käytettävissä";

/* HTTP result code string */
"success" = "onnistui";

/* HTTP result code string */
"switching protocols" = "vaihdetaan protokollia";

/* HTTP result code string */
"temporarily redirected" = "väliaikaisesti uudelleenohjattu";

/* HTTP result code string */
"unacceptable" = "ei kelpaa";

/* HTTP result code string */
"unauthorized" = "valtuuttamaton";

/* HTTP result code string */
"unimplemented" = "ei toteutettu";

/* HTTP result code string */
"unsupported media type" = "mediatyyppiä ei tueta";

/* HTTP result code string */
"unsupported version" = "versiota ei tueta";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "Kommunikoitaessa WWW-välityspalvelimen (HTTP) kanssa tapahtui virhe.";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "Kommunikoitaessa suojatun WWW-välityspalvelimen (HTTPS) kanssa tapahtui virhe.";

/* WebFoundationErrorUnknown description */
"Err-998" = "peruttu";

/* WebFoundationErrorCancelled description */
"Err-999" = "virheellinen verkko-osoite";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "Pyyntö aikakatkaistiin.";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "ei-tuettu verkko-osoite";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "Määriteltyä palvelinta ei löytynyt.";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "Palvelimeen ei voitu muodostaa yhteyttä.";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "Verkkoyhteys katkesi.";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "Nimipalveluvirhe";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "liikaa HTTP-uudelleenohjauksia";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "resurssi ei käytettävissä";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "Tietokoneen Internet-yhteys ei ole käytössä.";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "uudelleenohjattu ei mihinkään";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "Palvelin vastasi virheellisesti.";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "nollatavuinen resurssi";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "raakadataa ei voida purkaa";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "sisältödataa ei voida purkaa";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "vastausta ei voida jäsentää";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "Kansainvälinen verkkovierailu on pois käytöstä.";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "Datayhteyttä ei voida muodostaa, koska puhelu on meneillään.";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "Datayhteyttä ei sallita.";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "liian monta tekstipyyntöä";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "Pyydettyä verkko-osoitetta ei löytynyt palvelimelta.";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "tiedosto on hakemisto";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "Sinulla ei ole oikeutta käyttää pyydettyä resurssia.";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "resurssi ylittää enimmäiskoon";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "Palvelimeen ei voida muodostaa suojattua yhteyttä, koska tapahtui SSL-virhe.";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "Palvelimen varmenne on vanhentunut.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "Palvelimen varmenne on vanhentunut. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "Palvelimen varmenne on virheellinen.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "Palvelimen varmenne on virheellinen. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "Palvelimen varmenteen on allekirjoittanut tuntematon varmentaja.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "Palvelimen varmenteen on allekirjoittanut tuntematon varmentaja. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "Palvelimen varmenne ei ole vielä voimassa.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "Palvelimen varmenne ei ole vielä voimassa. Saatat muodostaa yhteyttä palvelimeen, joka teeskentelee olevansa ”%@”. Tämä voi vaarantaa luottamukselliset tietosi.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "Palvelin ei hyväksynyt varmennetta.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "Palvelin ”%@” ei hyväksynyt varmennetta.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "Palvelin vaatii asiakasvarmenteen.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "Palvelin ”%@” vaatii asiakasvarmenteen.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "verkosta ei voida ladata";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "Tiedostoa ei voida luoda";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "Tiedostoa ei voida avata";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "Tiedostoa suljettaessa tapahtui virhe";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "Tiedostoa ei voida kirjoittaa";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "Tiedostoa ei voida poistaa";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "Tiedostoa ei voida siirtää";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "Ladatun tiedoston purkaminen epäonnistui";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "Ladatun tiedoston purkaminen epäonnistui";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "Haluatko yhdistää palvelimeen siitä huolimatta?";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "Jos haluat muuttaa välipalvelinasetuksia, avaa Verkkoasetukset, napsauta Lisävalinnat ja napsauta Välipalvelimet. Jos tarvitset apua tämän ongelman kanssa, ota yhteyttä järjestelmän ylläpitäjään.";

/* Recovery suggestion */
"To change your proxy settings, open Network preferences, click Advanced, and then click Proxies. For help with this problem, contact your system administrator." = "Jos haluat muuttaa välipalvelinasetuksia, avaa Verkko-asetukset, osoita Lisävalinnat ja osoita Välipalvelimet. Jos tarvitset apua tämän ongelman kanssa, ota yhteys järjestelmän ylläpitäjään.";
